# SetAttribute Method (String, IList(Int32)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..SetAttribute Method (String, IList<(Of <(<'Int32>)>)>)
IFCAnyHandle Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetAttribute(
	string name,
	IList<int> values
)
```

Visual Basic
---
```text
Public Sub SetAttribute ( _
	name As String, _
	values As IList(Of Integer) _
)
```

Visual C++
---
```text
public:
void SetAttribute(
	String^ name,
	IList<int>^ values
)
```

# ### Parameters
name
    Type: System..::..String
values
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)>
# See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace